# pandas

In [6]:
import pandas as pd
iris = pd.read_csv("/Users/kyungeunjeon/Downloads/iris.csv")

In [8]:
iris
print(type(iris))

<class 'pandas.core.frame.DataFrame'>

In [11]:
# fancy version of ndarray = series
pd.Series([1,2,3,4])
pd.Series(range(5))

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [13]:
s=pd.Series([4,2,1,3])
s

0    4
1    2
2    1
3    3
dtype: int64

In [15]:
#series can make array() and index()
s.array 
s.index

RangeIndex(start=0, stop=4, step=1)

In [19]:
# Numpy for vectorized operation : mix numpy and series's index
import numpy as np
t = pd.Series([4,2,1,3],index=["a","b","c","d"])

In [17]:
t

a    4
b    2
c    1
d    3
dtype: int64

In [20]:
np.log(t)

a    1.386294
b    0.693147
c    0.000000
d    1.098612
dtype: float64

# Series indexing

In [25]:
# Series indexing
t[1]
t[[1,2]]
t["c"] #search with just index
t[t==3]
t[t%2==0]

a    4
b    2
dtype: int64

In [27]:
m = pd.Series([1,2,3,4], index = ["a","b","c","d"])
n = pd.Series([4,3,2,1], index = ["d","c","b","a"])
o = pd.Series([1,1,1,1,1], index = ["b","d","a","c","e"])

In [28]:
m

a    1
b    2
c    3
d    4
dtype: int64

In [29]:
n

d    4
c    3
b    2
a    1
dtype: int64

In [30]:
m+n #same with n+m

a    2
b    4
c    6
d    8
dtype: int64

In [31]:
n+m

a    2
b    4
c    6
d    8
dtype: int64

In [33]:
o

b    1
d    1
a    1
c    1
e    1
dtype: int64

In [32]:
n+o #not number nan (there is no value in n with e variable => NaN)
# But a weired thing is Nan is float64
# You need to take care of Missing values

a    2.0
b    3.0
c    4.0
d    5.0
e    NaN
dtype: float64

In [34]:
d = {"anna": "A+", "bob": "B-", "carol": "C", "dave": "D+"}
pd.Series(d)

In [35]:
d # just ':' means dictionaries

{'anna': 'A', 'bob': 'B+', 'carol': 'C', 'dave': 'D'}

In [36]:
pd.Series(d)

anna      A
bob      B+
carol     C
dave      D
dtype: object

In [37]:
pd.Series(d, index=["dave","carol","bob","anna"]) #reorder with index

dave      D
carol     C
bob      B+
anna      A
dtype: object

In [40]:
s = pd.Series(
  {"anna": "A+", "bob": "B-", "carol": "C", "dave": "D+"}, 
  index = ["erin","dave","carol","bob","anna"]
)

In [41]:
pd.isna(s) # find the missing values
# nan is not nan so cannot test for it

erin      True
dave     False
carol    False
bob      False
anna     False
dtype: bool

In [42]:
s = pd.Series(
  {"anna": "A+", "bob": "B-", "carol": "C", "dave": "D+"}, 
  index = ["erin","dave","carol","bob","anna"]
)

In [43]:
s # You can check Nan or NA with isna()

erin     NaN
dave      D+
carol      C
bob       B-
anna      A+
dtype: object

In [ ]:
pd.isna(s)

erin      True
dave     False
carol    False
bob      False
anna     False
dtype: bool

In [45]:
np.nan == np.nan

False

In [46]:
pd.isna(pd.Series([1,2,3,None]))

0    False
1    False
2    False
3     True
dtype: bool

In [47]:
pd.isna(pd.Series([1,2,3,np.nan]))

0    False
1    False
2    False
3     True
dtype: bool

In [49]:
pd.isna(pd.Series([True, False, None]))

0    False
1    False
2     True
dtype: bool

In [51]:
# text string series
s = pd.Series(["the quick","brown fox","jumps"])
s

0    the quick
1    brown fox
2        jumps
dtype: object

In [52]:
s.str.upper()

0    THE QUICK
1    BROWN FOX
2        JUMPS
dtype: object

In [53]:
"Hello workd".upper()

'HELLO WORKD'

In [54]:
s.str.split(" ")

0    [the, quick]
1    [brown, fox]
2         [jumps]
dtype: object

In [59]:
# categroical series
pd.Series(["Mon","Tue","Wed"],
         dtype=pd.CategoricalDtype(
             categories=["Mon","Tue","Wed","Thu","Fri"],
             ordered=True)
         )

0    Mon
1    Tue
2    Wed
dtype: category
Categories (5, object): ['Mon' < 'Tue' < 'Wed' < 'Thu' < 'Fri']

In [63]:
pd.Series(["Mon","Tue","Wed"],
         dtype="category")

0    Mon
1    Tue
2    Wed
dtype: category
Categories (3, object): ['Mon', 'Tue', 'Wed']

In [67]:
# Create dataframes
n = 5
d = {
"id" : np.random.randint(100,999,n),
"weight": np.random.normal(70,20,n)}
d
df=pd.DataFrame(d)
df

    id     weight
0  193  99.897134
1  419  83.883972
2  708  75.201062
3  984  52.847680
4  673  65.292350

In [71]:
pd.DataFrame(
np.diag([1,2,3]),
columns = ["x","y","z"],
index = ["a","b","c"])

   x  y  z
a  1  0  0
b  0  2  0
c  0  0  3

In [72]:
# data frame indexing
df

    id     weight
0  193  99.897134
1  419  83.883972
2  708  75.201062
3  984  52.847680
4  673  65.292350

In [74]:
df["id"]

0    193
1    419
2    708
3    984
4    673
Name: id, dtype: int64

In [75]:
df.iloc[1]

id        419.000000
weight     83.883972
Name: 1, dtype: float64

In [76]:
df.loc[1]

id        419.000000
weight     83.883972
Name: 1, dtype: float64

In [78]:
df2 = df.copy()
df2

    id     weight
0  193  99.897134
1  419  83.883972
2  708  75.201062
3  984  52.847680
4  673  65.292350

In [80]:
df2.index = (["anna","bob","carol","dave","erin"])
df2

        id     weight
anna   193  99.897134
bob    419  83.883972
carol  708  75.201062
dave   984  52.847680
erin   673  65.292350

In [81]:
df2.loc[:,"weight"] #weight is list

anna     99.897134
bob      83.883972
carol    75.201062
dave     52.847680
erin     65.292350
Name: weight, dtype: float64

In [82]:
df2.loc[df2.id<300]

       id     weight
anna  193  99.897134

In [85]:
# views vs. copies : pandas always create the copied version
d = pd.DataFrame(np.arange(6).reshape(3,2), columns=["x","y"])
d

   x  y
0  0  1
1  2  3
2  4  5

In [86]:
v = d.iloc[0:2,0:2]
v

   x  y
0  0  1
1  2  3

In [87]:
v.iloc[0,1]=-1
print(v)
print(d) #copy but same.. syncronized

   x  y
0  0 -1
1  2  3
   x  y
0  0 -1
1  2  3
2  4  5

In [98]:
iris.query('SepalLengthCm > 5.1')

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
5,6,5.4,3.9,1.7,0.4,Iris-setosa
10,11,5.4,3.7,1.5,0.2,Iris-setosa
14,15,5.8,4.0,1.2,0.2,Iris-setosa
15,16,5.7,4.4,1.5,0.4,Iris-setosa
16,17,5.4,3.9,1.3,0.4,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [99]:
df

    id     weight
0  193  99.897134
1  419  83.883972
2  708  75.201062
3  984  52.847680
4  673  65.292350

In [100]:
df.size

10

# combine data frames

In [102]:
# 4 different ways to merge data : https://blog.naver.com/koeun0811/222671392480
northeast = pd.Series(['CT','ME','MA','NH','RI','VT','NJ','NY','PA'])
south = pd.Series(['DE','FL','GA','MD','NC','SC','VA','DC','WV','AL','KY','MS','TN','AR','LA','OK','TX'])
midwest = pd.Series(['IL','IN','MN','MO','NE','ND','SD','IA','KS','MI','OH','WI'])
west = pd.Series(['AZ','CO','ID','MT','NV','NM','UT','WY','AK','CA','HI','OR','WA'])

In [104]:
new_east_test = northeast.append(south)
new_east = northeast.append(south).reset_index(drop=True)
print(new_east_test) 
print(new_east) #indexing newly

0     CT
1     ME
2     MA
3     NH
4     RI
5     VT
6     NJ
7     NY
8     PA
0     DE
1     FL
2     GA
3     MD
4     NC
5     SC
6     VA
7     DC
8     WV
9     AL
10    KY
11    MS
12    TN
13    AR
14    LA
15    OK
16    TX
dtype: object
0     CT
1     ME
2     MA
3     NH
4     RI
5     VT
6     NJ
7     NY
8     PA
9     DE
10    FL
11    GA
12    MD
13    NC
14    SC
15    VA
16    DC
17    WV
18    AL
19    KY
20    MS
21    TN
22    AR
23    LA
24    OK
25    TX
dtype: object

/var/folders/0m/966_8tjn5pddy9gxt6rqdwh00000gn/T/ipykernel_1249/3455082987.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  new_east_test = northeast.append(south)
/var/folders/0m/966_8tjn5pddy9gxt6rqdwh00000gn/T/ipykernel_1249/3455082987.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  new_east = northeast.append(south).reset_index(drop=True)

In [ ]:
# a.append(b)
# pd.concat([a,b])
# a.join(b)
# pd.merge([a,b])

# Group by

In [110]:
# df.groupby("student").agg("mean")
# df.groupby("student").agg([np.mean, np.std])
# df.groupby("student").agg([np.mean, np.std]).columns

In [113]:
df = pd.DataFrame(
  np.random.randn(5, 3), 
  columns=['A', 'B', 'C']
)
df

df.columns
df.index

RangeIndex(start=0, stop=5, step=1)

In [115]:
df = pd.DataFrame(
  np.random.randn(3, 3), 
  index=['x','y','z'], 
  columns=['A', 'B', 'C']
)
df

df.columns
df.index

Index(['x', 'y', 'z'], dtype='object')

In [118]:
a = pd.Index(['c', 'b', 'a'])
b = pd.Index(['c', 'e', 'd'])

In [121]:
# Set relationship among sets 
a.union(b)
a.intersection(b)

Index(['c'], dtype='object')

In [122]:
# Let's put "names" of rows and cols!!
df = pd.DataFrame(
  np.random.randn(3, 3), 
  index=pd.Index(['x','y','z'], name="rows"),
  columns=pd.Index(['A', 'B', 'C'], name="cols")
)
df

cols         A         B         C
rows
x     1.466199  0.161431 -0.320958
y    -1.105206  0.535977 -0.589209
z     1.339868  0.903798 -2.812100

In [123]:
df.columns

Index(['A', 'B', 'C'], dtype='object', name='cols')

In [124]:
df.index

Index(['x', 'y', 'z'], dtype='object', name='rows')

In [126]:
df.index.set_names("m")
df

cols         A         B         C
rows
x     1.466199  0.161431 -0.320958
y    -1.105206  0.535977 -0.589209
z     1.339868  0.903798 -2.812100

In [128]:
pd.Index([1,2,3,np.nan,5]).fillna(0)
pd.Index(["A","B",np.nan,"D"]).fillna("Z")

Index(['A', 'B', 'Z', 'D'], dtype='object')

# Multi-index

In [134]:
data = pd.DataFrame({
  "a": ["bar","bar","foo","foo"],
  "b": ["one","two","one","two"],
  "c": ["z","y","x","w"],
  "d": [1,2,3,4]
})

In [132]:
# MultiIndexes
# solution: MultiIndex.from_product
tuples = [('A','x'), ('A','y'),
          ('B','x'), ('B','y'),
          ('C','x'), ('C','y')]
tuples
pd.MultiIndex.from_tuples(tuples, names=["1st","2nd"])

MultiIndex([('A', 'x'),
            ('A', 'y'),
            ('B', 'x'),
            ('B', 'y'),
            ('C', 'x'),
            ('C', 'y')],
           names=['1st', '2nd'])

In [133]:
pd.MultiIndex.from_product([["A","B","C"],["x","y"]], names=["1st","2nd"])

MultiIndex([('A', 'x'),
            ('A', 'y'),
            ('B', 'x'),
            ('B', 'y'),
            ('C', 'x'),
            ('C', 'y')],
           names=['1st', '2nd'])

In [137]:
idx = pd.MultiIndex.from_tuples(tuples, names=["1st","2nd"])
idx

MultiIndex([('A', 'x'),
            ('A', 'y'),
            ('B', 'x'),
            ('B', 'y'),
            ('C', 'x'),
            ('C', 'y')],
           names=['1st', '2nd'])

In [138]:
pd.DataFrame(np.random.rand(6,2), 
             index = idx, 
             columns=["m","n"])

                m         n
1st 2nd
A   x    0.551438  0.281446
    y    0.696804  0.195227
B   x    0.606870  0.880026
    y    0.096818  0.192133
C   x    0.215639  0.188405
    y    0.754690  0.657913

In [139]:
#column multiindexing
cidx = pd.MultiIndex.from_product([["A","B"],["x","y"]], names=["c1","c2"])
pd.DataFrame(np.random.rand(4,4), columns = cidx)

ridx = pd.MultiIndex.from_product([["m","n"],["l","p"]], names=["r1","r2"])
pd.DataFrame(np.random.rand(4,4), index= ridx, columns = cidx)

c1            A                   B
c2            x         y         x         y
r1 r2
m  l   0.640931  0.790745  0.634866  0.525668
   p   0.847012  0.394228  0.646491  0.551204
n  l   0.129371  0.630758  0.946915  0.980000
   p   0.012559  0.943762  0.388982  0.450370

In [141]:
data

     a    b  c  d
0  bar  one  z  1
1  bar  two  y  2
2  foo  one  x  3
3  foo  two  w  4

In [142]:
data.iloc[0]

a    bar
b    one
c      z
d      1
Name: 0, dtype: object

In [143]:
data.iloc[0,1]

'one'

In [144]:
data.iloc[(0,1)]

'one'

In [145]:
data.iloc[0,[0,1]]

a    bar
b    one
Name: 0, dtype: object

In [148]:
data2 = pd.DataFrame(np.random.rand(4,4), index= ridx, columns = cidx)
data2

c1            A                   B
c2            x         y         x         y
r1 r2
m  l   0.921456  0.289566  0.003691  0.594927
   p   0.650961  0.588405  0.875140  0.957048
n  l   0.366043  0.588073  0.036002  0.260355
   p   0.397868  0.963794  0.434403  0.224686

In [149]:
data2.xs("p",level="r2")

c1         A                   B
c2         x         y         x         y
r1
m   0.650961  0.588405  0.875140  0.957048
n   0.397868  0.963794  0.434403  0.224686

In [150]:
data2.xs("y",level="c2",axis=1)

c1            A         B
r1 r2
m  l   0.289566  0.594927
   p   0.588405  0.957048
n  l   0.588073  0.260355
   p   0.963794  0.224686

In [152]:
data.set_index(['a','b'])

         c  d
a   b
bar one  z  1
    two  y  2
foo one  x  3
    two  w  4

In [153]:
data

     a    b  c  d
0  bar  one  z  1
1  bar  two  y  2
2  foo  one  x  3
3  foo  two  w  4

# Long to wide (pivot)

In [155]:
df = pd.DataFrame({
   "country": ["A","A","A","A","B","B","B","B","C","C","C","C"],
    "year":   [1999,1999,2000,2000,1999,1999,2000,2000,1999,1999,2000,2000],
    "type":   ["cases","pop","cases","pop","cases","pop","cases","pop","cases","pop","cases","pop"],
    "count":  ["0.7K", "19M", "2K", "20M", "37K", "172M", " 80K", "174M", "212K", "1T", "213K", "1T"]
})
df

   country  year   type count
0        A  1999  cases  0.7K
1        A  1999    pop   19M
2        A  2000  cases    2K
3        A  2000    pop   20M
4        B  1999  cases   37K
5        B  1999    pop  172M
6        B  2000  cases   80K
7        B  2000    pop  174M
8        C  1999  cases  212K
9        C  1999    pop    1T
10       C  2000  cases  213K
11       C  2000    pop    1T

In [156]:
df_wide = df.pivot(
  index=["country","year"], 
  columns="type", 
  values="count"
)
df_wide

type         cases   pop
country year
A       1999  0.7K   19M
        2000    2K   20M
B       1999   37K  172M
        2000   80K  174M
C       1999  212K    1T
        2000  213K    1T

In [157]:
df_long = df.melt(
  id_vars="country", 
  var_name="year"
)
df_long

   country   year  value
0        A   year   1999
1        A   year   1999
2        A   year   2000
3        A   year   2000
4        B   year   1999
5        B   year   1999
6        B   year   2000
7        B   year   2000
8        C   year   1999
9        C   year   1999
10       C   year   2000
11       C   year   2000
12       A   type  cases
13       A   type    pop
14       A   type  cases
15       A   type    pop
16       B   type  cases
17       B   type    pop
18       B   type  cases
19       B   type    pop
20       C   type  cases
21       C   type    pop
22       C   type  cases
23       C   type    pop
24       A  count   0.7K
25       A  count    19M
26       A  count     2K
27       A  count    20M
28       B  count    37K
29       B  count   172M
30       B  count    80K
31       B  count   174M
32       C  count   212K
33       C  count     1T
34       C  count   213K
35       C  count     1T

In [158]:
df = pd.DataFrame({
  "country": ["A","A","B","B","C","C"],
  "year":    [1999, 2000, 1999, 2000, 1999, 2000],
  "rate":    ["0.7K/19M", "2K/20M", "37K/172M", "80K/174M", "212K/1T", "213K/1T"]
})
df

  country  year      rate
0       A  1999  0.7K/19M
1       A  2000    2K/20M
2       B  1999  37K/172M
3       B  2000  80K/174M
4       C  1999   212K/1T
5       C  2000   213K/1T

In [159]:
df.assign(
  rate = lambda d: d.rate.str.split("/")
)

  country  year         rate
0       A  1999  [0.7K, 19M]
1       A  2000    [2K, 20M]
2       B  1999  [37K, 172M]
3       B  2000  [80K, 174M]
4       C  1999   [212K, 1T]
5       C  2000   [213K, 1T]

In [160]:
( df
  .assign(
    rate = lambda d: d.rate.str.split("/")
  )
  .explode("rate")
  .assign(
    type = lambda d: ["cases", "pop"] * int(d.shape[0]/2)
  )
)

  country  year  rate   type
0       A  1999  0.7K  cases
0       A  1999   19M    pop
1       A  2000    2K  cases
1       A  2000   20M    pop
2       B  1999   37K  cases
2       B  1999  172M    pop
3       B  2000   80K  cases
3       B  2000  174M    pop
4       C  1999  212K  cases
4       C  1999    1T    pop
5       C  2000  213K  cases
5       C  2000    1T    pop

## Exercise 1

In [161]:
df = pd.read_csv("https://sta663-sp22.github.io/slides/data/us_rent.csv")
df

            name variable  estimate    moe
0        Alabama   income   24476.0  136.0
1        Alabama     rent     747.0    3.0
2         Alaska   income   32940.0  508.0
3         Alaska     rent    1200.0   13.0
4        Arizona   income   27517.0  148.0
..           ...      ...       ...    ...
99     Wisconsin     rent     813.0    3.0
100      Wyoming   income   30854.0  342.0
101      Wyoming     rent     828.0   11.0
102  Puerto Rico   income       NaN    NaN
103  Puerto Rico     rent     464.0    6.0

[104 rows x 4 columns]

In [169]:
df.pivot(index="name", 
          columns="variable", 
          values=["estimate","moe"])

                     estimate            moe
variable               income    rent income  rent
name
Alabama               24476.0   747.0  136.0   3.0
Alaska                32940.0  1200.0  508.0  13.0
Arizona               27517.0   972.0  148.0   4.0
Arkansas              23789.0   709.0  165.0   5.0
California            29454.0  1358.0  109.0   3.0
Colorado              32401.0  1125.0  109.0   5.0
Connecticut           35326.0  1123.0  195.0   5.0
Delaware              31560.0  1076.0  247.0  10.0
District of Columbia  43198.0  1424.0  681.0  17.0
Florida               25952.0  1077.0   70.0   3.0
Georgia               27024.0   927.0  106.0   3.0
Hawaii                32453.0  1507.0  218.0  18.0
Idaho                 25298.0   792.0  208.0   7.0
Illinois              30684.0   952.0   83.0   3.0
Indiana               27247.0   782.0  117.0   3.0
Iowa                  30002.0   740.0  143.0   4.0
Kansas                29126.0   801.0  208.0   5.0
Kentucky              24702.0   713.0  159.0   4.0
Louisiana             25086.0   825.0  155.0   4.0
Maine                 26841.0   808.0  187.0   7.0
Maryland              37147.0  1311.0  152.0   5.0
Massachusetts         34498.0  1173.0  199.0   5.0
Michigan              26987.0   824.0   82.0   3.0
Minnesota             32734.0   906.0  189.0   4.0
Mississippi           22766.0   740.0  194.0   5.0
Missouri              26999.0   784.0  113.0   4.0
Montana               26249.0   751.0  206.0   9.0
Nebraska              30020.0   773.0  146.0   4.0
Nevada                29019.0  1017.0  213.0   6.0
New Hampshire         33172.0  1052.0  387.0   9.0
New Jersey            35075.0  1249.0  148.0   4.0
New Mexico            24457.0   809.0  214.0   6.0
New York              31057.0  1194.0   69.0   3.0
North Carolina        26482.0   844.0  111.0   3.0
North Dakota          32336.0   775.0  245.0   9.0
Ohio                  27435.0   764.0   94.0   2.0
Oklahoma              26207.0   766.0  101.0   3.0
Oregon                27389.0   988.0  146.0   4.0
Pennsylvania          28923.0   885.0  119.0   3.0
Puerto Rico               NaN   464.0    NaN   6.0
Rhode Island          30210.0   957.0  259.0   6.0
South Carolina        25454.0   836.0  123.0   4.0
South Dakota          28821.0   696.0  276.0   7.0
Tennessee             25453.0   808.0  102.0   4.0
Texas                 28063.0   952.0  110.0   2.0
Utah                  27928.0   948.0  239.0   6.0
Vermont               29351.0   945.0  361.0  11.0
Virginia              32545.0  1166.0  202.0   5.0
Washington            32318.0  1120.0  113.0   4.0
West Virginia         23707.0   681.0  203.0   6.0
Wisconsin             29868.0   813.0  135.0   3.0
Wyoming               30854.0   828.0  342.0  11.0

In [170]:
df.pivot(index="name", 
          columns="variable", 
          values="estimate")

variable               income    rent
name
Alabama               24476.0   747.0
Alaska                32940.0  1200.0
Arizona               27517.0   972.0
Arkansas              23789.0   709.0
California            29454.0  1358.0
Colorado              32401.0  1125.0
Connecticut           35326.0  1123.0
Delaware              31560.0  1076.0
District of Columbia  43198.0  1424.0
Florida               25952.0  1077.0
Georgia               27024.0   927.0
Hawaii                32453.0  1507.0
Idaho                 25298.0   792.0
Illinois              30684.0   952.0
Indiana               27247.0   782.0
Iowa                  30002.0   740.0
Kansas                29126.0   801.0
Kentucky              24702.0   713.0
Louisiana             25086.0   825.0
Maine                 26841.0   808.0
Maryland              37147.0  1311.0
Massachusetts         34498.0  1173.0
Michigan              26987.0   824.0
Minnesota             32734.0   906.0
Mississippi           22766.0   740.0
Missouri              26999.0   784.0
Montana               26249.0   751.0
Nebraska              30020.0   773.0
Nevada                29019.0  1017.0
New Hampshire         33172.0  1052.0
New Jersey            35075.0  1249.0
New Mexico            24457.0   809.0
New York              31057.0  1194.0
North Carolina        26482.0   844.0
North Dakota          32336.0   775.0
Ohio                  27435.0   764.0
Oklahoma              26207.0   766.0
Oregon                27389.0   988.0
Pennsylvania          28923.0   885.0
Puerto Rico               NaN   464.0
Rhode Island          30210.0   957.0
South Carolina        25454.0   836.0
South Dakota          28821.0   696.0
Tennessee             25453.0   808.0
Texas                 28063.0   952.0
Utah                  27928.0   948.0
Vermont               29351.0   945.0
Virginia              32545.0  1166.0
Washington            32318.0  1120.0
West Virginia         23707.0   681.0
Wisconsin             29868.0   813.0
Wyoming               30854.0   828.0

In [177]:
# if you add .something in different line, use ( ) 
(df
 .pivot(index="name", columns="variable", values="estimate")
 .assign(ratio = lambda d: d.income/d.rent))

variable               income    rent      ratio
name
Alabama               24476.0   747.0  32.765730
Alaska                32940.0  1200.0  27.450000
Arizona               27517.0   972.0  28.309671
Arkansas              23789.0   709.0  33.552891
California            29454.0  1358.0  21.689249
Colorado              32401.0  1125.0  28.800889
Connecticut           35326.0  1123.0  31.456812
Delaware              31560.0  1076.0  29.330855
District of Columbia  43198.0  1424.0  30.335674
Florida               25952.0  1077.0  24.096565
Georgia               27024.0   927.0  29.152104
Hawaii                32453.0  1507.0  21.534837
Idaho                 25298.0   792.0  31.941919
Illinois              30684.0   952.0  32.231092
Indiana               27247.0   782.0  34.842711
Iowa                  30002.0   740.0  40.543243
Kansas                29126.0   801.0  36.362047
Kentucky              24702.0   713.0  34.645161
Louisiana             25086.0   825.0  30.407273
Maine                 26841.0   808.0  33.219059
Maryland              37147.0  1311.0  28.334859
Massachusetts         34498.0  1173.0  29.410060
Michigan              26987.0   824.0  32.751214
Minnesota             32734.0   906.0  36.130243
Mississippi           22766.0   740.0  30.764865
Missouri              26999.0   784.0  34.437500
Montana               26249.0   751.0  34.952064
Nebraska              30020.0   773.0  38.835705
Nevada                29019.0  1017.0  28.533923
New Hampshire         33172.0  1052.0  31.532319
New Jersey            35075.0  1249.0  28.082466
New Mexico            24457.0   809.0  30.231150
New York              31057.0  1194.0  26.010888
North Carolina        26482.0   844.0  31.376777
North Dakota          32336.0   775.0  41.723871
Ohio                  27435.0   764.0  35.909686
Oklahoma              26207.0   766.0  34.212794
Oregon                27389.0   988.0  27.721660
Pennsylvania          28923.0   885.0  32.681356
Puerto Rico               NaN   464.0        NaN
Rhode Island          30210.0   957.0  31.567398
South Carolina        25454.0   836.0  30.447368
South Dakota          28821.0   696.0  41.409483
Tennessee             25453.0   808.0  31.501238
Texas                 28063.0   952.0  29.477941
Utah                  27928.0   948.0  29.459916
Vermont               29351.0   945.0  31.059259
Virginia              32545.0  1166.0  27.911664
Washington            32318.0  1120.0  28.855357
West Virginia         23707.0   681.0  34.812041
Wisconsin             29868.0   813.0  36.738007
Wyoming               30854.0   828.0  37.263285

In [185]:
cereal = pd.read_csv("https://sta663-sp22.github.io/slides/data/cereal.csv")
cereal
cereal.groupby("type")

In [180]:
cereal.groupby("type").groups

{'Cold': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76], 'Hot': [20, 43, 57]}

In [184]:
cereal.groupby("type").size()

type
Cold    74
Hot      3
dtype: int64

In [186]:
# groupby is iterable like for loop
cereal.groupby("type").get_group("Hot")
#cereal.groupby("mfr").get_group("Post")

                      name          mfr type  calories  sugars     rating
20  Cream of Wheat (Quick)      Nabisco  Hot       100       0  64.533816
43                   Maypo       Maltex  Hot       100       3  54.850917
57          Quaker Oatmeal  Quaker Oats  Hot       100       1  50.828392

In [187]:
cereal.groupby("type").get_group("Cold")

,name,mfr,type,calories,sugars,rating
0,100% Bran,Nabisco,Cold,70,6,68.402973
1,100% Natural Bran,Quaker Oats,Cold,120,8,33.983679
2,All-Bran,Kellogg's,Cold,70,5,59.425505
3,All-Bran with Extra Fiber,Kellogg's,Cold,50,0,93.704912
4,Almond Delight,Ralston Purina,Cold,110,8,34.384843
...,...,...,...,...,...,...
72,Triples,General Mills,Cold,110,3,39.106174
73,Trix,General Mills,Cold,110,12,27.753301
74,Wheat Chex,Ralston Purina,Cold,100,3,49.787445
75,Wheaties,General Mills,Cold,100,3,51.592193
76,Wheaties Honey Gold,General Mills,Cold,110,8,36.187559

In [188]:
for name, group in cereal.groupby("type"):
  print(name)
  print(group)
  print("")

Cold
                         name             mfr  type  calories  sugars  \
0                   100% Bran         Nabisco  Cold        70       6
1           100% Natural Bran     Quaker Oats  Cold       120       8
2                    All-Bran       Kellogg's  Cold        70       5
3   All-Bran with Extra Fiber       Kellogg's  Cold        50       0
4              Almond Delight  Ralston Purina  Cold       110       8
..                        ...             ...   ...       ...     ...
72                    Triples   General Mills  Cold       110       3
73                       Trix   General Mills  Cold       110      12
74                 Wheat Chex  Ralston Purina  Cold       100       3
75                   Wheaties   General Mills  Cold       100       3
76        Wheaties Honey Gold   General Mills  Cold       110       8

       rating
0   68.402973
1   33.983679
2   59.425505
3   93.704912
4   34.384843
..        ...
72  39.106174
73  27.753301
74  49.787445
75  51.592193
76  36.187559

[74 rows x 6 columns]

Hot
                      name          mfr type  calories  sugars     rating
20  Cream of Wheat (Quick)      Nabisco  Hot       100       0  64.533816
43                   Maypo       Maltex  Hot       100       3  54.850917
57          Quaker Oatmeal  Quaker Oats  Hot       100       1  50.828392

In [189]:
# aggregation = summarize
cereal.groupby("mfr").agg("mean")

                  calories    sugars     rating
mfr
General Mills   111.363636  7.954545  34.485852
Kellogg's       108.695652  7.565217  44.038462
Maltex          100.000000  3.000000  54.850917
Nabisco          86.666667  1.833333  67.968567
Post            108.888889  8.777778  41.705744
Quaker Oats      95.000000  5.500000  42.915990
Ralston Purina  115.000000  6.125000  41.542997

In [190]:
# non-numeric then just drop and go away! Nan
cereal.groupby("mfr").agg([np.mean, np.std])

/var/folders/0m/966_8tjn5pddy9gxt6rqdwh00000gn/T/ipykernel_1249/1138569552.py:1: FutureWarning: ['name', 'type'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  cereal.groupby("mfr").agg([np.mean, np.std])

                  calories               sugars               rating  \
                      mean        std      mean       std       mean
mfr
General Mills   111.363636  10.371873  7.954545  3.872704  34.485852
Kellogg's       108.695652  22.218818  7.565217  4.500768  44.038462
Maltex          100.000000        NaN  3.000000       NaN  54.850917
Nabisco          86.666667  10.327956  1.833333  2.857738  67.968567
Post            108.888889  10.540926  8.777778  4.576510  41.705744
Quaker Oats      95.000000  29.277002  5.500000  4.780914  42.915990
Ralston Purina  115.000000  22.677868  6.125000  3.563205  41.542997


                      std
mfr
General Mills    8.946704
Kellogg's       14.457434
Maltex                NaN
Nabisco          5.509326
Post            10.047647
Quaker Oats     16.797673
Ralston Purina   6.080841

In [191]:
cereal.groupby("mfr").agg({
  "calories": ['min', 'max'],
  "sugars":   ['mean', 'median'],
  "rating":   ['sum', 'count']
})

               calories         sugars              rating
                    min  max      mean median          sum count
mfr
General Mills       100  140  7.954545    8.5   758.688737    22
Kellogg's            50  160  7.565217    7.0  1012.884634    23
Maltex              100  100  3.000000    3.0    54.850917     1
Nabisco              70  100  1.833333    0.0   407.811403     6
Post                 90  120  8.777778   10.0   375.351697     9
Quaker Oats          50  120  5.500000    6.0   343.327919     8
Ralston Purina       90  150  6.125000    5.5   332.343977     8

In [192]:
cereal.groupby("mfr", as_index=False).agg(
  min_cal = ("calories", "min"),
  max_cal = ("calories", "max"),
  med_sugar = ("sugars", "median"),
  avg_rating = ("rating", "mean")
)

              mfr  min_cal  max_cal  med_sugar  avg_rating
0   General Mills      100      140        8.5   34.485852
1       Kellogg's       50      160        7.0   44.038462
2          Maltex      100      100        3.0   54.850917
3         Nabisco       70      100        0.0   67.968567
4            Post       90      120       10.0   41.705744
5     Quaker Oats       50      120        6.0   42.915990
6  Ralston Purina       90      150        5.5   41.542997

In [193]:
cereal.groupby("mfr").transform(np.mean) #normalization

/var/folders/0m/966_8tjn5pddy9gxt6rqdwh00000gn/T/ipykernel_1249/3000664002.py:1: FutureWarning: Dropping invalid columns in DataFrameGroupBy.transform is deprecated. In a future version, a TypeError will be raised. Before calling .transform, select only columns which should be valid for the function.
  cereal.groupby("mfr").transform(np.mean)

      calories    sugars     rating
0    86.666667  1.833333  67.968567
1    95.000000  5.500000  42.915990
2   108.695652  7.565217  44.038462
3   108.695652  7.565217  44.038462
4   115.000000  6.125000  41.542997
..         ...       ...        ...
72  111.363636  7.954545  34.485852
73  111.363636  7.954545  34.485852
74  115.000000  6.125000  41.542997
75  111.363636  7.954545  34.485852
76  111.363636  7.954545  34.485852

[77 rows x 3 columns]

In [194]:
( cereal
  .groupby("mfr")
  .transform(
    lambda x: (x - np.mean(x))/np.std(x)
  ) 
)

/var/folders/0m/966_8tjn5pddy9gxt6rqdwh00000gn/T/ipykernel_1249/4170650715.py:1: FutureWarning: Dropping invalid columns in DataFrameGroupBy.transform is deprecated. In a future version, a TypeError will be raised. Before calling .transform, select only columns which should be valid for the function.
  ( cereal

    calories    sugars    rating
0  -1.767767  1.597191  0.086375
1   0.912871  0.559017 -0.568474
2  -1.780712 -0.582760  1.088220
3  -2.701081 -1.718649  3.512566
4  -0.235702  0.562544 -1.258442
..       ...       ...       ...
72 -0.134568 -1.309457  0.528580
73 -0.134568  1.069190 -0.770226
74 -0.707107 -0.937573  1.449419
75 -1.121403 -1.309457  1.957022
76 -0.134568  0.012013  0.194681

[77 rows x 3 columns]

In [196]:
cereal.groupby("mfr").size()

mfr
General Mills     22
Kellogg's         23
Maltex             1
Nabisco            6
Post               9
Quaker Oats        8
Ralston Purina     8
dtype: int64

In [200]:
cereal.groupby("mfr")
cereal

,name,mfr,type,calories,sugars,rating
0,100% Bran,Nabisco,Cold,70,6,68.402973
1,100% Natural Bran,Quaker Oats,Cold,120,8,33.983679
2,All-Bran,Kellogg's,Cold,70,5,59.425505
3,All-Bran with Extra Fiber,Kellogg's,Cold,50,0,93.704912
4,Almond Delight,Ralston Purina,Cold,110,8,34.384843
...,...,...,...,...,...,...
72,Triples,General Mills,Cold,110,3,39.106174
73,Trix,General Mills,Cold,110,12,27.753301
74,Wheat Chex,Ralston Purina,Cold,100,3,49.787445
75,Wheaties,General Mills,Cold,100,3,51.592193
76,Wheaties Honey Gold,General Mills,Cold,110,8,36.187559

In [198]:
cereal.groupby("mfr").filter(lambda x: len(x) > 10)

,name,mfr,type,calories,sugars,rating
2,All-Bran,Kellogg's,Cold,70,5,59.425505
3,All-Bran with Extra Fiber,Kellogg's,Cold,50,0,93.704912
5,Apple Cinnamon Cheerios,General Mills,Cold,110,10,29.509541
6,Apple Jacks,Kellogg's,Cold,110,14,33.174094
7,Basic 4,General Mills,Cold,130,8,37.038562
11,Cheerios,General Mills,Cold,110,1,50.764999
12,Cinnamon Toast Crunch,General Mills,Cold,120,9,19.823573
13,Clusters,General Mills,Cold,110,7,40.400208
14,Cocoa Puffs,General Mills,Cold,110,13,22.736446
16,Corn Flakes,Kellogg's,Cold,100,2,45.863324
17,Corn Pops,Kellogg's,Cold,110,12,35.782791
18,Count Chocula,General Mills,Cold,110,13,22.396513
19,Cracklin' Oat Bran,Kellogg's,Cold,110,7,40.448772
21,Crispix,Kellogg's,Cold,110,3,46.895644
22,Crispy Wheat & Raisins,General Mills,Cold,100,10,36.176196
24,Froot Loops,Kellogg's,Cold,110,13,32.207582
25,Frosted Flakes,Kellogg's,Cold,110,11,31.435973
26,Frosted Mini-Wheats,Kellogg's,Cold,100,7,58.345141
28,Fruitful Bran,Kellogg's,Cold,120,12,41.015492
31,Golden Grahams,General Mills,Cold,110,9,23.804043
36,Honey Nut Cheerios,General Mills,Cold,110,10,31.072217
38,Just Right Crunchy Nuggets,Kellogg's,Cold,110,6,36.523683
39,Just Right Fruit & Nut,Kellogg's,Cold,140,9,36.471512
40,Kix,General Mills,Cold,110,3,39.241114
42,Lucky Charms,General Mills,Cold,110,12,26.734515
46,Mueslix Crispy Blend,Kellogg's,Cold,160,13,30.313351
47,Multi-Grain Cheerios,General Mills,Cold,100,6,40.105965
48,Nut&Honey Crunch,Kellogg's,Cold,120,9,29.924285
49,Nutri-Grain Almond-Raisin,Kellogg's,Cold,140,7,40.692320
50,Nutri-grain Wheat,Kellogg's,Cold,90,2,59.642837
51,Oatmeal Raisin Crisp,General Mills,Cold,130,10,30.450843
53,Product 19,Kellogg's,Cold,100,3,41.503540
58,Raisin Bran,Kellogg's,Cold,120,12,39.259197
59,Raisin Nut Bran,General Mills,Cold,100,8,39.703400
60,Raisin Squares,Kellogg's,Cold,90,6,55.333142
62,Rice Krispies,Kellogg's,Cold,110,3,40.560159
66,Smacks,Kellogg's,Cold,110,15,31.230054
67,Special K,Kellogg's,Cold,110,3,53.131324
69,Total Corn Flakes,General Mills,Cold,110,3,38.839746
70,Total Raisin Bran,General Mills,Cold,140,14,28.592785
71,Total Whole Grain,General Mills,Cold,100,3,46.658844
72,Triples,General Mills,Cold,110,3,39.106174
73,Trix,General Mills,Cold,110,12,27.753301
75,Wheaties,General Mills,Cold,100,3,51.592193
76,Wheaties Honey Gold,General Mills,Cold,110,8,36.187559